{
   "token_bot": "5956003891:AAF9k0lCbhildThOwDj1BniNj84aSpUAwKQ",
   "user_id": 437327379,
   "greeting": "Давайте сначала познакомимся!\nМы раньше общались?",
   "help_text": "Я бот-помощник!\nЧтобы продолжить напишите /start",
   "text_i_know_you": "Мне нужно немного информации чтобы Вас найти",
   "text_i_know_no": "Тогда давайте познакомимся!",
   "what_name": "Как Вас зовут?",
   "what_company": "Обычно мне пишут представители различных компаний.\nВы какую компанию представляете?",
   "what_phone_num": "Хорошо!\nНапишете, пожалуйста, контактный телефон для обратной связи. \nЕсли по каким-либо причинам нет возможности написать, то просто напишите \"нет\" я пойму.",
   "what_email": "Принял!\nИ в завершении знакомства напишет, пожалуйста, адрес эл.почты для связи. \nЕсли по каким-либо причинам нет возможности написать, то просто напишите \"нет\" я пойму.",
   "end_reg": "Понял! Давайте уточним.",
   "i_not_find_name": "Я не нашел Ваше имя в своей записной книжке, хотя ранее общался с представителем Вашей компании.\nЕсли хотите чтобы я Вас запомнил, то нажмите кнопку \"Познакомиться\".",
   "i_not_find_company": "Я не нашел данную компанию в своей записной книжке. \nНажмите кнопку \"Познакомиться\" чтобы я Вас знал.",
   "reg_success": "Рад знакомству, я Вас запомнил.\nТеперь можете выбрать пункты меню под окном ввода сообщений.",
   "connect_information": "Надеюсь вся предоставленная мной информация Вам помогла.\nВот телеграмм разработчика https://t.me/BlackMarvel\nСсылка на GitHub https://github.com/Hashtagich",
   "text_completed_course_1": "Антон прошел следующие курсы:\n1) \"Поколение Python\": курс для начинающих - есть сертификат;\n2) \"Поколение Python\": курс для продвинутых - есть сертификат;\n3) \"Поколение Python\": курс для профессионалов - есть сертификат;\n4) \"100 Days of Code\";\n5) \"Обработка и анализ данных на Python\".\nБолее подробно о каждом курсе, если это понадобится, Антон расскажет сам.\nСертификаты также прилагаю.",
   "text_completed_course_2": "Ссылки на курсы:\n1) https://stepik.org/course/58852/syllabus;\n2) https://stepik.org/course/68343/syllabus;\n3) https://stepik.org/course/82541/syllabus;\n4) https://coursehunter.net/course/100-dney-koda-polnyy-uchebnyy-kurs-python-pro;\n5) https://coursehunter.net/course/obrabotka-i-analiz-dannyh-na-python\nПрофиль Антонна на stepik.org https://stepik.org/users/129414215?auth=login",
   "text_knowledge": "Если Вы проходили по ссылкам в разделе \"Пройденные курсы и сертификаты\" то могли заметить, что Антон изучил основы Python:\nАнтон работал со следующими библиотеками и фреймворками:\n- random;\n- tkinter;\n- pandas;\n- math;\n- csv, json, zipfile, pickle;\n- datetime, date, time, timedelta;\n- calendar;\n- collections;\n- itertools, re, functools, os;\n- requests;\n- smtplib;\n- bs4, selenium;\n- Flask;\n- telebot;\n- turtle;",
   "text_training_plan": "На вторую половину 2022 года был выстроен следующий учебны план:\n1) Пройти курсы \"Поколение Python\" на платформе Stepik - 3 курса;\n2) Пройти курс \"100 дней кода\"\n3) Изучить модули и фреймворки для реализации проектов для портфолио (pandas, django, sql и т.д.)\nНа текущий момент Антон продолжает изучение django, sql и дорабатывает свои проекты.\nПрограммист учится всегда.\nПодробнее о проектах в разделе \"Проекты\".",
   "text_project": "В портфолио Антона есть следующие проекты:\n- Игра \"Активити\" - это цифровая версия настольной игры \"Activity\", кстати Антон очень любит играть в неё с друзьями;\n- Телеграм Бот Толстяк Тони - это я его цифровой помощники.\n Я конечно не такой многофункциональный как Яндекс-станция Алиса, но стараюсь.\n Проекты в разработке:\n - Электронная визитная карточка - это сайт, который представляет собой красиво оформленную краткую информацию об Антоне со ссылками на проекты (репозитории), соцсети и контакты.\n - Веб-сайт компании - полноценный функционирующий сайт компании со ссылками страницами и обратной связью.\n Проекты для дальнейшего развития компетенций:\n - Программа для преобразования речи или теста в речь известных личностей или актёров дубляжа и озвучки. \n Необходимо глубокое изучение машинного обучения на что требуется приличное количество времени.\n - Игра \"Свинтус\" - это цифровая версия настольной игры \"Свинтус 2.0\", но она более динамическая и для её реализации нужно больше времени и более глубое изучение и практика в ООП.\n - Электронный строительный справочник - объёмный проект, включающий в себя все ГОСТы и стандарты в строительстве частных загородных домов, какие строительные материалы использовать, какой фундамент, на каком расстоянии и так далее.\n Проект требует обширных знаний в области строительства, желательно опыт и знание всех стандартов в данной области.",
   "text_project_1": "Ссылка на GitHub Антона\nhttps://github.com/Hashtagich",
   "target_goal": "Планы и цели:\n- Устроиться на работу и продолжать развивать компетенции в данном направлении;\n- Создавать новые программы и приложения для общего пользования; \n- Изучать другие направления в области программирования и ИТ - машинное обучение, аналитика данных, тестирование, разработка мобильных приложений, фронтэнд и т.д.",
   "text_personal_skills": "- Ответственный;\n- Коммуникабельный;\n- Обучаемый;\n- Организованный.",
   "text_last_work": "На прошлом месте работы Антон занимался цифровизацией производства и автоматизацией бизнес-процессов (далее - БП).\nРабота заключалась в том что нужно было:\n- Подробно описать БП с формулами эскизами рабочих окно, подготовить тех.задание с пошаговым описанием работы модулей или программы;\n- Изобразить схемы процесса;\n- Откуда и куда приходят и выходят данные, что хотим видеть на выходе того или иного модуля;\n- Как модули будут взаимодействовать друг с другом;\n- Какие должны быть отчёты и графики;\n- Контролировать процесс разработки модулей, консультировать разработчиков и направлять доп.информацию;\n- Приём готово участка, модуля программы и тестирование на работоспособность и корректности описанной в тех.задании.\nИз особенно важным моментов при выполнении данных задач было следующее:\n1) Самостоятельно работал с подрядчиками (разработчиками программного продукта) над разработкой и внедрением программного продукта \"Контролю Отчетно-исполнительной документации (ОИД) в ходе ремонта энергетического оборудования на всех его этапах\".\nОИД был разработан за 1 месяц и внедрён на всех филиалах компании, Антон лично контролировал работу программного продукта и проводил консультацию и обучение сотрудников компании, собирал предложения по улучшению ОИД в дальнейшем.\n2) Самостоятельно работал с подрядчиками над разработкой и внедрением программного продукта\n\"Диспетчеризация персонала\" - суть проекта заключалась то что создать программный продукт где можно будет отслеживать на каком ремонтном участке компании есть свободный персонал готовый к командировке на другой объект в период ремонтной программы.\nПроект был реализован и внедрён на всех филиалах компании в течении 3 месяцев.\n3) Последний наиболее важный момент — это участие в проекте, который охватывал почти все БП компании в сфере производства, но в целях соблюдения коммерческой тайны компании больше не могу сказать о чём проект и как он назывался.\nМогу только сказать, что Антон был часть проектной группы - функциональным экспертом, лично контролировал два модуля т.е. и частично консультировал и помогал в разработке остальных модулей программного продукта т.е. выполнял всё то, что было описано выше,\nтакже отправлялся на филиал для обучения персонала, тестирования программы на местах и помощи руководителю проекта в запуске пилотной версии программного продукта.\nБолее подробнее о прошлом месте работы можно узнать из резюме или лично у Антона естественно в рамках соблюдения коммерческой тайны предыдущего места работы.",
   "meet": "🤝Познакомиться",
   "info_author": "🗎Информация о разработчике",
   "info_author_back": "⬅Информация о разработчике",
   "connection_author": "📩Связь с разработчиком",
   "knowledge_py": "🐍Знание питона",
   "last_work": "🏢Прошлый опыт работы",
   "personal_skills": "📚Личные навыки",
   "goals_tasks": "🎯Планы и цели",
   "back": "⬅Назад",
   "btn_read_please": "Озвучить"
}
